#### We also import the sqlite3 library

In [1]:
import pandas as pd 
import sys
import sqlite3

#### Create a connection object and a local file to store the data in
If the file is already created, it means we will be connecting to an existing DB

In [3]:
connection = sqlite3.connect('./datasets/EmpData.db')

print('Database Opened Successfully !')

Database Opened Successfully !

#### Create a cursor object
The cursor object will be able to execute SQL commands

In [4]:
cursor = connection.cursor()

#### Formulate a query in order to create a new table
This will store information about employees in a fictional company

In [5]:
emp_table = """ CREATE TABLE Employees(
                                       ID_No VARCHAR(10) PRIMARY KEY,
                                       F_Name VARCHAR(12),
                                       L_Name VARCHAR(12),
                                       Deptt VARCHAR(15),
                                       Gender CHAR(10),
                                       City VARCHAR(40)
                                     );"""

#### Use the cursor object to execute the query

In [6]:
cursor.execute(emp_table)

print("We have successfully created Employee Table")

We have successfully created Employee Table

#### Running this query again will result in an error
Just like with any database, once cannot create a table with the same name as an existing table

In [7]:
cursor.execute(emp_table)

OperationalError: table Employees already exists

#### Insert the details of one employee
And use the cursor to execute the query

In [8]:
insert_emp = """INSERT INTO Employees VALUES('ID_1',
                                             'Xuan', 
                                             'Ping', 
                                             'Sales', 
                                             'Female', 
                                             'Beijing')"""

cursor.execute(insert_emp)

#### Since the ID is the primary key of the table, we cannot insert another row with the same ID

In [9]:
insert_emp = """INSERT INTO Employees VALUES('ID_1',
                                             'Susie', 
                                             'Schneider', 
                                             'Procurements', 
                                             'Female', 
                                             'Munich')"""

cursor.execute(insert_emp)

IntegrityError: UNIQUE constraint failed: Employees.ID_No

#### Re-insert the data, but with a different ID

In [10]:
insert_emp = """INSERT INTO Employees VALUES('ID_2',
                                             'Susie', 
                                             'Schneider', 
                                             'Procurements', 
                                             'Female', 
                                             'Munich')"""

cursor.execute(insert_emp)

#### Insert data for a 3rd employee

In [11]:
insert_emp = """INSERT INTO Employees VALUES('ID_3',
                                             'David', 
                                             'Lennon', 
                                             'HR', 
                                             'Male', 
                                             'Austin')"""

cursor.execute(insert_emp)

#### Add a 4th and 5th employee

In [12]:
insert_emp = """INSERT INTO Employees VALUES('ID_4',
                                             'Kagiso', 
                                             'Botha', 
                                             'Engineering', 
                                             'Male', 
                                             'Cape Town')"""

cursor.execute(insert_emp)

insert_emp = """INSERT INTO Employees VALUES('ID_5',
                                             'Linda', 
                                             'Steyn', 
                                             'Engineering', 
                                             'Female', 
                                             'Cape Town')"""

cursor.execute(insert_emp)

#### Commit the changes to the DB
The commit() function on the connection will commit/save the changes

In [13]:
connection.commit()

#### Running a Select query
View all the data in the Employees table

In [14]:
cursor.execute("SELECT * FROM Employees")

#### Retrieve the query results
The cursor's fetchall() function will return the rows as a list of tuples

In [15]:
employee_data = cursor.fetchall()

employee_data

[('ID_1', 'Xuan', 'Ping', 'Sales', 'Female', 'Beijing'),
 ('ID_2', 'Susie', 'Schneider', 'Procurements', 'Female', 'Munich'),
 ('ID_3', 'David', 'Lennon', 'HR', 'Male', 'Austin'),
 ('ID_4', 'Kagiso', 'Botha', 'Engineering', 'Male', 'Cape Town'),
 ('ID_5', 'Linda', 'Steyn', 'Engineering', 'Female', 'Cape Town')]

#### We convert the data to a DataFrame
Since the returned data is a list of tuples, we can create a DataFrame from it

In [16]:
employee_df = pd.DataFrame(data = list (employee_data),
                           columns = ['ID', 
                                      'FirstName', 
                                      'LastName', 
                                      'Department', 
                                      'Gender', 
                                      'City'])

employee_df

     ID FirstName   LastName    Department  Gender       City
0  ID_1      Xuan       Ping         Sales  Female    Beijing
1  ID_2     Susie  Schneider  Procurements  Female     Munich
2  ID_3     David     Lennon            HR    Male     Austin
3  ID_4    Kagiso      Botha   Engineering    Male  Cape Town
4  ID_5     Linda      Steyn   Engineering  Female  Cape Town

#### Select queries with a where clause

In [17]:
cursor.execute("select * from Employees where Gender = 'Female' ")

#### Retrieve the results

In [18]:
employee_female = cursor.fetchall()

employee_female

[('ID_1', 'Xuan', 'Ping', 'Sales', 'Female', 'Beijing'),
 ('ID_2', 'Susie', 'Schneider', 'Procurements', 'Female', 'Munich'),
 ('ID_5', 'Linda', 'Steyn', 'Engineering', 'Female', 'Cape Town')]

#### Perform a concatenation in the select clause
Here, we concatenate the first and last names of the employees

In [19]:
cursor.execute("select F_Name ||' '|| L_Name AS Full_Name, City \
               from Employees \
               where City == 'Cape Town'")

#### Retrieve the results and load into a DataFrame

In [20]:
capetown_employees = cursor.fetchall()

capetown_employees_df = pd.DataFrame( data = list(capetown_employees),
                                   columns = ['Full Name', 'Address'])

capetown_employees_df

      Full Name    Address
0  Kagiso Botha  Cape Town
1   Linda Steyn  Cape Town

#### Running a delete query

In [21]:
cursor.execute('DELETE FROM Employees WHERE F_Name = "Linda"')

#### View the contents of the DataFrame
The row for the employee Linda is no longer there

In [22]:
cursor.execute(' select * from Employees')

employee_data = cursor.fetchall()

employee_df = pd.DataFrame(data = list (employee_data),
                           columns = ['ID', 
                                      'FirstName', 
                                      'LastName', 
                                      'Department', 
                                      'Gender', 
                                      'City'])

employee_df

     ID FirstName   LastName    Department  Gender       City
0  ID_1      Xuan       Ping         Sales  Female    Beijing
1  ID_2     Susie  Schneider  Procurements  Female     Munich
2  ID_3     David     Lennon            HR    Male     Austin
3  ID_4    Kagiso      Botha   Engineering    Male  Cape Town

#### Commit changes

In [23]:
connection.commit()

#### Close the connection
Once the connection is closed, we'll need to reopen the DB

In [24]:
connection.close()

#### Running a query will result in errors now
Since the connection is closed

In [24]:
cursor.execute('select * from Company')

ProgrammingError: Cannot operate on a closed database.

#### Re-open the connection and create a new cursor

In [25]:
connection = sqlite3.connect("./DATASETS/EmpData.db")

cursor = connection.cursor()

#### Confirm the data is still available

In [26]:
cursor.execute(' select * from Employees')

employee_data = cursor.fetchall()

employee_df = pd.DataFrame(data = list (employee_data),
                           columns = ['ID', 
                                      'FirstName', 
                                      'LastName', 
                                      'Department', 
                                      'Gender', 
                                      'City'])

employee_df

     ID FirstName   LastName    Department  Gender       City
0  ID_1      Xuan       Ping         Sales  Female    Beijing
1  ID_2     Susie  Schneider  Procurements  Female     Munich
2  ID_3     David     Lennon            HR    Male     Austin
3  ID_4    Kagiso      Botha   Engineering    Male  Cape Town

#### Drop the Employees table

In [27]:
cursor.execute('DROP TABLE Employees')

print('Our table is Dropped !!!')

Our table is Dropped !!!

#### The select query will result in an error
Since the table is no longer there

In [28]:
cursor.execute(' select * from Employees')

OperationalError: no such table: Employees

#### Commit changes and close the connection

In [29]:
connection.commit()
connection.close()